;****************************************************************************************
;*											*
;*	Данный файл является программой для пустого приложения пользователя		*
;*											*
;****************************************************************************************
;*											*
;*	Наименование контроллера:МК-4хх							*
;*	Дата создания		:25.11.03						*
;*	Версия файла		:2.00							*
;*											*
;*	Автор			:Игнатьев Михаил					*
;*	Организация		:Авитрон-Ойл						*
;*											*
;****************************************************************************************
F252=0
F6720=1

MCU_Type=F6720

		if MCU_Type == F252
	LIST P=18F252			;]Выбирете тип процессора
	#include	<p18f252.inc>	;]
		else
	LIST P=18F6720			;]Выбирете тип процессора
	#include	<p18f6720.inc>	;]
		endif

	#define	libdir	c:\Program Files\Microchip\MPLABC18\v3.47	;Начало пути к библиотечным файлам
	#define	workdir	d:\Kostya\dev\workspace\electronic\MPLAB	;Начало пути к рабочим файлам проекта

;****************************************************************************************

	#include	<d:\Kostya\dev\workspace\electronic\MPLAB\macro4xx_UsApp.inc>	;Включение дополнительных файлов
	#include	<d:\Kostya\dev\workspace\electronic\MPLAB\MK4_set.inc>

;****************************************************************************************
;Переменные
Stack_Zone	udata	H'E00'

Stack_Begin	res	H'100'


;****************************************************************************************
;Область темпов для задачи ввода-вывода

;****************************************************************************************
;Константы

;****************************************************************************************
;Определения

;****************************************************************************************
;Макросы

Dummy_sub	macro

	retlw	H'FF'
	dw	H'FFFF'

	endm

;****************************************************************************************
;****************************************************************************************
;Исполняемый код

Us_App_Vectors	code	H'C000'

;****************************************************************************************

;	exsub	Init_User_Application
;	Dummy_sub

	exsub	User_Application
	bra	usapp_zone
	nop

;****************************************************************************************

	exsub	Optional_Handler_Main_Port1
	Dummy_sub

;****************************************************************************************

	exsub	Optional_Handler_LoInt_Port1
	Dummy_sub

;****************************************************************************************

	exsub	Optional_Handler_Main_Port2
	Dummy_sub

;****************************************************************************************

	exsub	Optional_Handler_LoInt_Port2
	Dummy_sub

;****************************************************************************************

usapp_zone
	lfsr	FSR1,Stack_Begin
	egoto	C_PROJECT1

ID_User_App
;Здесь записывается версия приложения пользователя
	db	"TEST 0.2",H'00'

EE_Id_Vect	Code	H'F00014'

	db	Low ID_User_App,High ID_User_App,Upper ID_User_App

	END
